fitzuma_tank/0/H2O
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      H2O;
}
// ************************************************************************* //

dimensions          [0 0 0 0 0 0 0];

internalField       uniform 0;

boundaryField
{
    Mesh_1
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
