fitzuma_tank/0/aerosolBin7
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      aerosolBin7;
}

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 7.55e-6;

boundaryField
{
    Mesh_1
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
