fitzuma_tank/constant/sprayCloudProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      sprayCloudProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solution
{
    active          true;
    coupled         true;
    transient       yes;

    // Keep parcel-to-gas momentum coupling.
    cellValueSourceCorrection on;

    maxCo           0.3;
    writeFields     true;

    sourceTerms
    {
        schemes
        {
            // For the paper benchmark, only gas momentum coupling is needed.
            // rho source should remain zero because phaseChangeModel is none.
            rho             explicit 1;
            U               explicit 1;
        }
    }

    interpolationSchemes
    {
        rho             cell;
        U               cellPoint;
        thermo:mu       cell;
        T               cell;
        Cp              cell;
        p               cell;
        kappa           cell;
    }

    integrationSchemes
    {
        U               Euler;

        // T is not physically solved in the benchmark, but some spray-cloud
        // infrastructure may still require a T integration entry.
        T               analytical;
    }
}


constantProperties
{
    // Paper cases are room temperature:
    // Case 1: 291 K
    // Case 2: 288 K
    T0              291;

    // Water properties near room temperature.
    rho0            997;
    Cp0             4187;

    constantVolume  false;
}


subModels
{
    particleForces
    {
        sphereDrag;
    }

    injectionModels
    {
        model1
        {
            type            coneNozzleInjection;

            SOI             0;

            // Paper simulated first 1200 s after spray activation.
            duration        1200;

            parcelBasisType mass;
            injectionMethod disc;

            // Keep this if your current coneNozzleInjection setup accepts it.
            flowType        flowRateAndDischarge;

            // Paper nozzle orifice diameter = 1.2 mm.
            outerDiameter   1.2e-3;
            innerDiameter   0;

            // Set this to your actual nozzle position.
            // Paper nozzle is 300 mm below the top of the vessel.
            position        (-0.3138483 0 0);

            // Set this according to your coordinate system.
            // Use downward direction.
            direction       (-1 0 0);

            parcelsPerSecond 200000;

            // Water spray flow rate = 2 L/min = 3.333333e-5 m3/s.
            //
            // WARNING:
            // Depending on the exact coneNozzleInjection implementation,
            // flowRateProfile may be interpreted as an absolute flow rate
            // or as a profile shape scaled by massTotal.
            // Check injected mass in the log / postProcessing.
            flowRateProfile constant 3.333333e-5;

            // If your OpenFOAM version requires massTotal, use:
            // massTotal = rhoWater * Q * duration
            //           = 997 * 3.333333e-5 * 1200
            //           ≈ 39.88 kg
            massTotal       39.88;

            Cd              constant 0.9;

            // Paper spray angle:
            // Case 1 nozzle: 27 deg total spray angle
            // Case 2 nozzle: 66 deg total spray angle
            //
            // Many OpenFOAM cone injection models use thetaOuter as cone
            // half-angle. If so:
            // Case 1: thetaOuter = 13.5
            // Case 2: thetaOuter = 33.0
            thetaInner      constant 0.0;
            thetaOuter      constant 13.5;

            sizeDistribution
            {
                type        RosinRammler;

                RosinRammlerDistribution
                {
                    // This is only an approximation.
                    // Paper nozzle 1 droplet sizes mostly 121-340 um,
                    // peak around 195 um.
                    minValue        1.21e-4;
                    maxValue        3.40e-4;
                    lambda          1.95e-4;
                    n               3;
                }
            }
        }
    }

    dispersionModel none;

    patchInteractionModel standardWallInteraction;

    // Paper neglects thermal phase change/energy coupling.
    heatTransferModel none;

    // Required by spray cloud infrastructure.
    // Use water, not C7H16.
    compositionModel singlePhaseMixture;

    // Critical for paper benchmark:
    // no evaporation, no boiling, no condensation mass transfer.
    phaseChangeModel none;

    surfaceFilmModel none;

    atomizationModel none;

    // Paper neglects droplet fragmentation and coalescence.
    breakupModel none;

    stochasticCollisionModel none;

    radiation       off;

    standardWallInteractionCoeffs
    {
        // Paper says droplets disappear once they hit the internal wall.
        // Try escape first. If OpenFOAM rejects it, use stick.
        type            escape;
    }

    singlePhaseMixtureCoeffs
    {
        phases
        (
            liquid
            {
                H2O     1;
            }
        );
    }
}


cloudFunctions
{}


// ************************************************************************* //
